{"id": 0, "table_type": "0", "question": "请问批发业注册资本最高的前3家公司的名称以及他们的注册资本（单位为万元）？", "plan": ["调用找公司名称的工具：查询批发业的所有公司名称。", "调用查公司信息的工具：查询这些公司的信息，找出它们的注册资本。", "调用筛选工具：根据注册资本取前3位公司，并获取对应的注册资本数额。"]}
{"id": 1, "table_type": "0", "question": "找下注册号为320512400000458是哪个公司？", "plan": ["调用找公司名称的工具：通过注册号为320512400000458查询公司名称。"]}
{"id": 4, "table_type": "0", "question": "请查询景津装备股份有限公司所属的行业类别，并告知在该行业分类下共有多少家公司？", "plan": ["调用查公司信息的工具：查询景津装备股份有限公司的信息，找出公司所属的行业类别。", "调用找公司名称的工具：查询该行业类别下的所有公司名称和数量。"]}
{"id": 5, "table_type": "0", "question": "我想要查询浙江时立态合科技有限公司的组织机构代码是多少？", "plan": ["调用查公司信息的工具：查询浙江时立态合科技有限公司的信息，找出组织机构代码。"]}
{"id": 6, "table_type": "0", "question": "瑞丰光电的法定代表人、注册地址和电子邮箱分别是？", "plan": ["调用查公司信息的工具：查询瑞丰光电的公司信息，找出法定代表人、注册地址、电子邮箱。"]}
{"id": 7, "table_type": "0", "question": "我想了解酒、饮料和精制茶制造业这个行业的公司有哪些，请列出注册资本最大的3家头部公司，并给出他们的具体注册资本数额。", "plan": ["调用找公司名称的工具：查询酒、饮料和精制茶制造业的所有公司名称。", "调用查公司信息的工具：查询这些公司的信息，找出它们的注册资本。", "调用筛选工具：根据注册资本取top 3的公司，并获取具体注册资本数额。"]}
{"id": 8, "table_type": "0", "question": "我想了解天味食品的法定代表人、注册地和电子邮箱分别为何？", "plan": ["调用查公司信息的工具：查询天味食品的公司信息，找出法定代表人、注册地、电子邮箱。"]}
{"id": 12, "table_type": "0", "question": "浙江朗迪集团股份有限公司的邮政编码和注册地址分别是？", "plan": ["调用查公司信息的工具：查询浙江朗迪集团股份有限公司的信息，找出邮政编码和注册地址。"]}
{"id": 13, "table_type": "0", "question": "平潭碧水源水务有限公司的企业性质、登记状况、创立时间分别是什么。", "plan": ["调用查公司信息的工具：查询平潭碧水源水务有限公司的企业性质、登记状况、创立时间。"]}
{"id": 15, "table_type": "0", "question": "请帮我查询一下上能电气股份有限公司的成立日期，同时请提供该公司的办公地点及联系方式。", "plan": ["调用查公司信息的工具：查询上能电气股份有限公司的信息，找出成立日期、办公地点和联系方式。"]}
{"id": 20, "table_type": "0", "question": "我想了解重庆莱美药业股份有限公司的注册状况、企业类别以及成立日期。", "plan": ["调用查公司信息的工具：查询重庆莱美药业股份有限公司的信息，获取注册状况、企业类别以及成立日期。"]}
{"id": 23, "table_type": "0", "question": "帮我查一下健帆生物科技集团股份有限公司的行业归属，并告知该行业内的企业总数是多少？", "plan": ["调用查公司信息的工具：查询健帆生物科技集团股份有限公司的信息，找出公司所属的行业。", "调用找公司名称的工具：查询该行业内所有公司的名称和数量。"]}
{"id": 30, "table_type": "0", "question": "请问德艺文化创意集团股份有限公司成立的准确日期，同时能否告知其注册办公地点及联系方式。", "plan": ["调用查公司信息的工具：查询德艺文化创意集团股份有限公司的成立日期、注册办公地点和联系方式。"]}
{"id": 33, "table_type": "0", "question": "请核查注册编号为370503228012016的公司的具体名字。", "plan": ["调用找公司名称的工具：通过注册编号为370503228012016查询公司名称。"]}
{"id": 34, "table_type": "0", "question": "我想了解天津鹏翎集团股份有限公司的组织机构代码是什么？", "plan": ["调用查公司信息的工具：查询天津鹏翎集团股份有限公司的信息，找出其组织机构代码。"]}
{"id": 35, "table_type": "0", "question": "我想要查询亚光科技集团股份有限公司的法人代表是什么？", "plan": ["调用查公司信息的工具：查询亚光科技集团股份有限公司的信息，找出法人代表信息。"]}
{"id": 42, "table_type": "0", "question": "我想了解日月重工股份有限公司成立的准确日期，同时能否提供该公司的办公地点及联系电话。", "plan": ["调用查公司信息的工具：查询日月重工股份有限公司的信息，找出成立日期、办公地点和联系电话。"]}
{"id": 43, "table_type": "0", "question": "耐普矿机的法人、注册地址和电子邮箱分别是什么？", "plan": ["调用查公司信息的工具：查询耐普矿机的公司信息，找出法人、注册地址、电子邮箱。"]}
{"id": 46, "table_type": "0", "question": "请列出开采辅助活动注册资本最大的3家头部公司，并给出他们的具体注册资本数额", "plan": ["调用找公司名称的工具：查询开采辅助活动的所有公司名称。", "调用查公司信息的工具：查询这些公司的信息，找出它们的注册资本。", "调用筛选工具：按照注册资本取前3家公司，并获取具体的注册资本数额。"]}
{"id": 47, "table_type": "0", "question": "我想了解江西国泰永固科技有限公司的组织机构代码是什么？", "plan": ["调用查公司信息的工具：查询江西国泰永固科技有限公司的信息，找出组织机构代码。"]}
{"id": 48, "table_type": "0", "question": "请核对一下，注册编号为610000100085935，这个公司叫什么。", "plan": ["调用找公司名称的工具：通过注册编号为610000100085935查询公司名称。"]}
{"id": 49, "table_type": "0", "question": "我想查询剑阁万德斯环保科技有限责任公司的企业登记状态、企业类型以及成立时间。", "plan": ["调用查公司信息的工具：查询剑阁万德斯环保科技有限责任公司的信息，找出企业登记状态、企业类型以及成立时间。"]}
{"id": 55, "table_type": "0", "question": "请查询一下劲拓股份的联系电话以及电子邮箱地址。此外，我想知道公司董秘的名字，以便于我反馈一些事宜。", "plan": ["调用查公司信息的工具：查询劲拓股份的公司信息，找出联系电话和电子邮箱地址。", "调用查公司信息的工具：再次查询劲拓股份的公司信息，找出公司董秘的名字。"]}
{"id": 57, "table_type": "0", "question": "汉威科技的法人、注册地和电子邮箱分别是？", "plan": ["调用查公司信息的工具：查询汉威科技的公司信息，找出法人、注册地、电子邮箱。"]}
{"id": 66, "table_type": "0", "question": "请帮我了解江苏金迪克生物技术股份有限公司所在的行业领域，并告知在该行业领域内总共有多少家企业？", "plan": ["调用查公司信息的工具：查询江苏金迪克生物技术股份有限公司的信息，找出公司所在的行业领域。", "调用找公司名称的工具：根据行业领域查询该领域内的企业数量。"]}
{"id": 67, "table_type": "0", "question": "能否列出计算机、通信和其他电子设备制造业注册资本排名前3位的公司，并提供它们的具体注册资本数额？", "plan": ["调用找公司名称的工具：查询计算机、通信和其他电子设备制造业的所有公司名称。", "调用查公司信息的工具：查询这些公司的注册资本信息。", "调用筛选工具：根据注册资本取top 3，并获取它们的具体注册资本数额。"]}
{"id": 76, "table_type": "0", "question": "能看下龙岩卓越新能源股份有限公司在其首次公开募股中的主承销商是谁吗，以及募资的净额数值", "plan": ["调用查公司信息的工具：查询龙岩卓越新能源股份有限公司的信息，找出首次公开募股的主承销商和募资净额数值。"]}
{"id": 78, "table_type": "0", "question": "金卡智能集团股份有限公司首次公开募股中的主承销商是？实际募集净额为多少", "plan": ["调用查公司信息的工具：查询金卡智能集团股份有限公司的信息，找出首次公开募股的主承销商。", "调用查公司信息的工具：查询金卡智能集团股份有限公司的信息，找出首次公开募股的实际募集净额。"]}
{"id": 80, "table_type": "0", "question": "咨询下450200000031278是哪家公司的注册号？", "plan": ["调用找公司名称的工具：通过注册编号为450200000031278查询公司名称。"]}
{"id": 82, "table_type": "0", "question": "请查询山东赛托生物科技股份有限公司的邮政编码和注册地址。", "plan": ["调用查公司信息的工具：查询山东赛托生物科技股份有限公司的信息，找出邮政编码和注册地址。"]}
{"id": 87, "table_type": "0", "question": "请提供北京长久物流股份有限公司的公司的邮政编码和注册地址。", "plan": ["调用查公司信息的工具：查询北京长久物流股份有限公司的信息，找出公司的邮政编码和注册地址。"]}
{"id": 94, "table_type": "0", "question": "大唐华银电力股份有限公司成立的准确日期，办公地址及联系方式分别是什么。", "plan": ["调用查公司信息的工具：查询大唐华银电力股份有限公司的成立日期、办公地址和联系方式。"]}
{"id": 96, "table_type": "0", "question": "青岛港的法定代表人、注册地址和电子邮箱分别是什么？", "plan": ["调用查公司信息的工具：查询青岛港的公司信息，找出法定代表人、注册地址、电子邮箱。"]}
{"id": 100, "table_type": "0", "question": "帮我查询一下河南中敏传感器技术研究院有限公司的组织机构代码", "plan": ["调用查公司信息的工具：查询河南中敏传感器技术研究院有限公司的信息，找出其组织机构代码。"]}
{"id": 101, "table_type": "0", "question": "请问一下江苏南大光电材料股份有限公司的法定代表人是哪位？", "plan": ["调用查公司信息的工具：查询江苏南大光电材料股份有限公司的信息，找出法定代表人。"]}
{"id": 102, "table_type": "0", "question": "请查询谱尼测试集团股份有限公司的主要承销商以及首次公开发行的募集资金净额。", "plan": ["调用查公司信息的工具：查询谱尼测试集团股份有限公司的信息，找出主要承销商和首次公开发行的募集资金净额。"]}
{"id": 105, "table_type": "0", "question": "查询一下惠城环保的联系电话和电子邮箱，同时请告知我该公司董事会秘书的名字，我有一些事情需要反馈。", "plan": ["调用查公司信息的工具：查询惠城环保的公司信息，找出联系电话和电子邮箱。", "调用查公司信息的工具：再次查询惠城环保的公司信息，找出董事会秘书的名字。"]}
{"id": 106, "table_type": "0", "question": "我意欲与深圳市英唐智能控制股份有限公司的法定代表人取得联系，敢问其姓名为谁？", "plan": ["调用查公司信息的工具：查询深圳市英唐智能控制股份有限公司的信息，找出法定代表人的姓名。"]}
{"id": 107, "table_type": "0", "question": "我想了解股票简称为文灿股份的公司，其法定代表人、注册地址和电子邮箱分别是什么？", "plan": ["调用找公司名称的工具：通过股票简称文灿股份来查询公司全称。", "调用查公司信息的工具：使用公司全称来获取法定代表、注册地址和电子邮箱信息。"]}
{"id": 108, "table_type": "0", "question": "我想查下注册编号为440300210985799的企业叫啥。", "plan": ["调用找公司名称的工具：通过注册编号为440300210985799查询公司名称。"]}
{"id": 109, "table_type": "0", "question": "请查询福建广生堂药业股份有限公司成立的准确日期，同时请告知其办公地点及联系电话。", "plan": ["调用查公司信息的工具：查询福建广生堂药业股份有限公司的信息，找出成立日期、办公地点和联系电话。"]}
{"id": 113, "table_type": "0", "question": "我想知晓浙江荣晟环保纸业股份有限公司的确切成立时间，同时能否提供该公司的办公地点和联系方式？", "plan": ["调用查公司信息的工具：查询浙江荣晟环保纸业股份有限公司的信息，找出成立时间、办公地点和联系方式。"]}
{"id": 114, "table_type": "0", "question": "福建阿石创新材料股份有限公司的法人是？", "plan": ["调用查公司信息的工具：查询福建阿石创新材料股份有限公司的信息，找出公司的法人。"]}
{"id": 115, "table_type": "0", "question": "请帮我调研一下佳禾智能科技股份有限公司所在的行业，并告知该行业目前总共有多少家企业？", "plan": ["调用查公司信息的工具：查询佳禾智能科技股份有限公司的信息，找出公司所在的行业领域。", "调用找公司名称的工具：查询该行业领域的所有公司名称和数量。"]}
{"id": 116, "table_type": "0", "question": "想了解注册号为510109000426149的公司名称。", "plan": ["调用找公司名称的工具：通过注册号为510109000426149查询公司名称。"]}
{"id": 117, "table_type": "0", "question": "我想了解股票简称名为马应龙的公司，其法定代表人、注册地址以及电子邮箱的具体信息是什么？", "plan": ["调用查公司信息的工具：查询股票简称名为马应龙的公司信息，找出法定代表人、注册地址、电子邮箱。"]}
{"id": 118, "table_type": "0", "question": "请提供上海航天汽车机电股份有限公司的邮政编码和注册地址。", "plan": ["调用查公司信息的工具：查询上海航天汽车机电股份有限公司的信息，找出邮政编码和注册地址。"]}
{"id": 126, "table_type": "0", "question": "请问濮阳运达风电有限公司的登记情况、企业性质以及成立时间。", "plan": ["调用查公司信息的工具：查询濮阳运达风电有限公司的登记情况、企业性质和成立时间。"]}
{"id": 127, "table_type": "0", "question": "我想了解化学原料和化学制品制造业这个行业的企业名录，能否提供注册资本最高的3家公司的名称以及它们的注册资本数额？", "plan": ["调用找公司名称的工具：查询化学原料和化学制品制造业的所有公司名称。", "调用查公司信息的工具：查询这些公司的信息，找出它们的注册资本。", "调用筛选工具：筛选出注册资本最高的三家公司，并获取它们的名称和注册资本数额。"]}
{"id": 128, "table_type": "0", "question": "我想了解天津卓朗信息科技股份有限公司的登记状况、企业性质以及成立日期。", "plan": ["调用查公司信息的工具：查询天津卓朗信息科技股份有限公司的信息，获取其登记状况、企业性质和成立日期。"]}
{"id": 129, "table_type": "0", "question": "帮忙找下无锡上机数控股份有限公司的企业主承销商以及首次公开发行募集资金净额。", "plan": ["调用查公司信息的工具：查询无锡上机数控股份有限公司的信息，找出企业主承销商和首次公开发行募集资金净额。"]}
{"id": 130, "table_type": "0", "question": "无锡宝通投资有限公司的组织机构代码是哪个？", "plan": ["调用查公司信息的工具：查询无锡宝通投资有限公司的信息，找出组织机构代码。"]}
{"id": 134, "table_type": "0", "question": "广州万孚生物技术股份有限公司的法人的名字是什么？", "plan": ["调用查公司信息的工具：查询广州万孚生物技术股份有限公司的信息，找出法人的名字。"]}
{"id": 136, "table_type": "0", "question": "请查询一下440112003853270这个注册号是哪个公司", "plan": ["调用找公司名称的工具：通过注册编号为440112003853270查询公司名称。"]}
{"id": 138, "table_type": "0", "question": "重庆渝胜道科智能科技有限公司的组织机构代码是哪个？", "plan": ["调用查公司信息的工具：查询重庆渝胜道科智能科技有限公司的信息，找出其组织机构代码。"]}
{"id": 139, "table_type": "0", "question": "请提供天域生态环境股份有限公司的公司的邮政编码和注册地。", "plan": ["调用查公司信息的工具：查询天域生态环境股份有限公司的信息，找出公司的邮政编码和注册地。"]}
{"id": 140, "table_type": "0", "question": "中新苏州工业园区开发集团股份有限公司的法人代表是？", "plan": ["调用查公司信息的工具：查询中新苏州工业园区开发集团股份有限公司的信息，找出法人代表信息。"]}
{"id": 141, "table_type": "0", "question": "我想知晓天津凯发电气股份有限公司的成立日期，同时烦请提供该公司的注册办公地点及联络电话。", "plan": ["调用查公司信息的工具：查询天津凯发电气股份有限公司的信息，找出成立日期、注册办公地点和联络电话。"]}
{"id": 144, "table_type": "0", "question": "我想查询宽城碧水源环保有限公司的组织机构代码是什么？", "plan": ["调用查公司信息的工具：查询宽城碧水源环保有限公司的组织机构代码。"]}
{"id": 145, "table_type": "0", "question": "道路运输业这个行业的公司有哪些，请列出注册资本最大的3家头部公司，并给出他们的具体注册资本数额", "plan": ["调用找公司名称的工具：查询道路运输业的所有公司名称。", "调用查公司信息的工具：查询这些公司的信息，找出它们的注册资本。", "调用筛选工具：根据注册资本取前3家公司，并获取它们的注册资本数额。"]}
{"id": 146, "table_type": "0", "question": "我想掌握桃李面包股份有限公司的确切成立日期，同时烦请告知其办公地点及联络电话。", "plan": ["调用查公司信息的工具：查询桃李面包股份有限公司的信息，找出成立日期、办公地点和联络电话。"]}
{"id": 153, "table_type": "0", "question": "请问化学原料和化学制品制造业这个行业的公司有哪些，请列出注册资本最大的3家头部公司，并给出他们的具体注册资本数额", "plan": ["调用找公司名称的工具：查询化学原料和化学制品制造业的所有公司名称。", "调用查公司信息的工具：查询这些公司的信息，找出它们的注册资本。", "调用筛选工具：筛选出注册资本最大的三家公司，并获取它们的注册资本数额。"]}
{"id": 155, "table_type": "0", "question": "请问江苏怡达化学股份有限公司的法定代表人是谁？", "plan": ["调用查公司信息的工具：查询江苏怡达化学股份有限公司的信息，找出法定代表人。"]}
{"id": 156, "table_type": "0", "question": "请问安井食品集团股份有限公司的成立日，办公地点和联系电话分别是？", "plan": ["调用查公司信息的工具：查询安井食品集团股份有限公司的信息，找出成立日、办公地点和联系电话。"]}
{"id": 165, "table_type": "0", "question": "山西安泰集团股份有限公司这个公司，企业主承销商是？首次公开发行募集资金净额是多少。", "plan": ["调用查公司信息的工具：查询山西安泰集团股份有限公司的企业主承销商信息。", "调用查公司信息的工具：查询山西安泰集团股份有限公司首次公开发行募集资金净额。"]}
{"id": 166, "table_type": "0", "question": "请查询闻泰科技股份有限公司的行业分类以及该分类下的公司总数是多少？", "plan": ["调用查公司信息的工具：查询闻泰科技股份有限公司的行业分类信息。", "调用找公司名称的工具：根据该行业分类查询所有公司名称和数量。"]}
{"id": 168, "table_type": "0", "question": "厦工股份的法定代表人、注册地和电子邮箱分别是什么？", "plan": ["调用查公司信息的工具：查询厦工股份的公司信息，找出法定代表人、注册地、电子邮箱。"]}
{"id": 174, "table_type": "0", "question": "浙江朗迪集团股份有限公司企业的主承销商和首次公开发行募集资金净额分别是？", "plan": ["调用查公司信息的工具：查询浙江朗迪集团股份有限公司的信息，找出企业的主承销商和首次公开发行募集资金净额。"]}
{"id": 177, "table_type": "0", "question": "陕西黑猫焦化股份有限公司在其首次公开募股中的主承销商以及募资的净额。", "plan": ["调用查公司信息的工具：查询陕西黑猫焦化股份有限公司的信息，找出首次公开募股的主承销商和募资净额。"]}
{"id": 179, "table_type": "0", "question": "查一下杭州百诚医药科技股份有限公司的邮政编码和注册地址。", "plan": ["调用查公司信息的工具：查询杭州百诚医药科技股份有限公司的信息，找出邮政编码和注册地址。"]}
{"id": 182, "table_type": "0", "question": "请提供东威科技的联系方式，包括电话号码和电子邮件地址。同时，我还需要获取该公司秘书的姓名。", "plan": ["调用查公司信息的工具：查询东威科技的公司信息，找出联系方式和秘书姓名。"]}
{"id": 183, "table_type": "0", "question": "我想查询一下，安徽荣晟包装新材料科技有限公司的组织机构代码是什么？", "plan": ["调用查公司信息的工具：查询安徽荣晟包装新材料科技有限公司的信息，找出其组织机构代码。"]}
{"id": 188, "table_type": "0", "question": "我想查询一下，四川巴蜀书社有限公司的组织机构代码", "plan": ["调用查公司信息的工具：查询四川巴蜀书社有限公司的信息，找出组织机构代码。"]}
{"id": 189, "table_type": "0", "question": "能否提供中远海控的联系方式，包括电话和电子邮件地址？同时，我也需要了解该公司董事会秘书的姓名，以便我能够就某些事务与其沟通。", "plan": ["调用查公司信息的工具：查询中远海控的公司信息，找出联系方式和董事会秘书姓名。"]}
{"id": 192, "table_type": "0", "question": "你知道宜宾震裕汽车部件有限公司的组织机构代码是什么吗？", "plan": ["调用查公司信息的工具：查询宜宾震裕汽车部件有限公司的信息，找出组织机构代码。"]}
{"id": 193, "table_type": "0", "question": "请帮我查询一下股票简称为吉华集团的公司，其法定代表人、注册地址和电子邮箱分别是什么？", "plan": ["调用找公司名称的工具：通过股票简称吉华集团查询公司信息。", "调用查公司信息的工具：查询吉华集团的公司信息，找出法定代表人、注册地址和电子邮箱。"]}
{"id": 198, "table_type": "0", "question": "请帮助我查询深圳新宙邦科技股份有限公司所处的行业领域，并告知在该行业领域中总共存在多少家企业。", "plan": ["调用查公司信息的工具：查询深圳新宙邦科技股份有限公司的信息，找出公司所在的行业领域。", "调用找公司名称的工具：查询该行业领域的所有公司名称和数量。"]}
{"id": 200, "table_type": "0", "question": "请提供甘肃陇神戎发药业股份有限公司的邮编和注册地址。", "plan": ["调用查公司信息的工具：查询甘肃陇神戎发药业股份有限公司的信息，找出邮编和注册地址。"]}
{"id": 201, "table_type": "0", "question": "350781100073458注册的企业名称。", "plan": ["调用找公司名称的工具：通过注册编号为350781100073458查询企业名称。"]}
{"id": 202, "table_type": "0", "question": "我想知道上海雪榕生物科技股份有限公司的企业在其首次公开募资中的主承销商以及募资的净额。", "plan": ["调用查公司信息的工具：查询上海雪榕生物科技股份有限公司的信息，找出企业首次公开募资的主承销商和募资净额。"]}
{"id": 205, "table_type": "0", "question": "注册号为331127000025876的企业名称。", "plan": ["调用找公司名称的工具：通过注册号为331127000025876查询企业名称。"]}
{"id": 209, "table_type": "0", "question": "帮我查一下湖南金博碳素股份有限公司的行业归属，并告知该行业内的企业总数是多少？", "plan": ["调用查公司信息的工具：查询湖南金博碳素股份有限公司的信息，找出公司所在的行业归属。", "调用找公司名称的工具：查询该行业归属的所有公司名称和数量。"]}
{"id": 214, "table_type": "0", "question": "我想掌握水上运输业这个领域内的企业信息，能否提供注册资本最高的前3家公司名称及其具体的注册资本额（单位为万元）？", "plan": ["调用找公司名称的工具：查询水上运输业的所有公司名称。", "调用查公司信息的工具：查询这些公司的信息，找出它们的注册资本。", "调用筛选工具：筛选出注册资本最高的三家公司，并获取具体的注册资本额。"]}
{"id": 216, "table_type": "0", "question": "请帮我查询一下舟山市龙马环卫环境工程有限公司的登记情况、企业类别以及成立的具体日期。", "plan": ["调用查公司信息的工具：查询舟山市龙马环卫环境工程有限公司的登记情况、企业类别和成立日期。"]}
{"id": 217, "table_type": "0", "question": "我想要获取汉马科技公司的联系方式，包括电话号码和电子邮件地址，同时也请告知我该公司董事会秘书的名字，因为我需要就某些事务与其联系。", "plan": ["调用查公司信息的工具：查询汉马科技公司的联系方式和董事会秘书信息。"]}
{"id": 218, "table_type": "0", "question": "请问皮革、毛皮、羽毛及其制品和制鞋业这个行业的公司有哪些，请列出注册资本最大的3家头部公司，并给出他们的具体注册资本数额。", "plan": ["调用找公司名称的工具：查询皮革、毛皮、羽毛及其制品和制鞋业的所有公司名称。", "调用查公司信息的工具：查询这些公司的信息，找出它们的注册资本。", "调用筛选工具：根据注册资本取最大的3家公司，并获取它们的注册资本数额。"]}
{"id": 219, "table_type": "0", "question": "请提供鹏鹞环保的联系电话和电子邮件地址。此外，我还需要知道贵公司董事会秘书的姓名", "plan": ["调用查公司信息的工具：查询鹏鹞环保的公司信息，找出联系电话和电子邮件地址。", "调用查公司信息的工具：进一步查询鹏鹞环保的公司信息，找出董事会秘书的姓名。"]}
{"id": 222, "table_type": "0", "question": "浩云科技股份有限公司的邮政编码和注册地址分别是？。", "plan": ["调用查公司信息的工具：查询浩云科技股份有限公司的信息，找出邮政编码和注册地址。"]}
{"id": 223, "table_type": "0", "question": "宁波水表(集团)股份有限公司公司的法定代表人叫什么？", "plan": ["调用查公司信息的工具：查询宁波水表(集团)股份有限公司的信息，找出法定代表人。"]}
{"id": 224, "table_type": "0", "question": "同和药业的法定代表人、注册地和电子邮箱分别是？", "plan": ["调用查公司信息的工具：查询同和药业的公司信息，找出法定代表人、注册地、电子邮箱。"]}
{"id": 226, "table_type": "0", "question": "请调查上海威派格智慧水务股份有限公司的企业在其首次公开募股中的主承销商以及募资的净额。", "plan": ["调用查公司信息的工具：查询上海威派格智慧水务股份有限公司的信息，找出首次公开募股的主承销商和募资净额。"]}
{"id": 227, "table_type": "0", "question": "我想了解东海县万德斯环保科技有限责任公司的登记状态、企业类别以及成立日期。", "plan": ["调用查公司信息的工具：查询东海县万德斯环保科技有限责任公司的信息，找出登记状态、企业类别以及成立日期。"]}
{"id": 229, "table_type": "0", "question": "请帮我了解浙江百达精工股份有限公司所属的行业领域，并告知在该行业领域内共有多少家企业？", "plan": ["调用查公司信息的工具：查询浙江百达精工股份有限公司的信息，找出公司所在的行业领域。", "调用找公司名称的工具：查询该行业领域的所有公司名称和数量。"]}
